Autodesk.Revit.DB.Structure.YJustification
The justification of the framing element in Y.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.YJustification.Right
Justification to the right of the element.

Autodesk.Revit.DB.Structure.YJustification.Origin
Justification to the origin of the element.

Autodesk.Revit.DB.Structure.YJustification.Center
Justification to the geometrical center of the element.

Autodesk.Revit.DB.Structure.YJustification.Left
Justification to the left of the element.